---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.Pipe
zh: 管道、水管、管线
source: html/aa1b8294-c12d-ece0-00af-b17c1f1c9e03.htm
---
# Autodesk.Revit.DB.Plumbing.Pipe

**中文**: 管道、水管、管线

A pipe in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class Pipe : MEPCurve
```

## Remarks
The pipe is only available in the Autodesk Revit MEP product.